{
  "misc.actuallyadditions.energy_tick": "RF/t",
  "misc.actuallyadditions.energy": "RF",
  "misc.actuallyadditions.energy_name": "Redstone Flux",
  "misc.actuallyadditions.power_long": "%s/%s Redstone Flux",
  "misc.actuallyadditions.power_single": "%s Redstone Flux",
  "misc.actuallyadditions.power_single_short": "%s RF",
  "misc.actuallyadditions.power_double": "%s / %s Redstone Flux",
  "misc.actuallyadditions.power_double_short": "%s / %s RF",
  "misc.actuallyadditions.power_name_long": "Redstone Flux",
  "misc.actuallyadditions.power_name_short": "RF",
  
  "achievement.actuallyadditions.craftEnergyface.desc": "Craft a Phantom Energyface",
  "achievement.actuallyadditions.craftEnergyface": "Zoom, Zoom, RF!",
  
  "booklet.actuallyadditions.indexEntry.functionalNoRF": "Blocks that don't use RF",
  "booklet.actuallyadditions.indexEntry.functionalRF": "Blocks that use RF",
  "booklet.actuallyadditions.indexEntry.generatingRF": "Blocks that generate RF",
  "booklet.actuallyadditions.indexEntry.itemsNoRF": "Items that don't use RF",
  "booklet.actuallyadditions.indexEntry.itemsRF": "Items that use RF",
  
  "booklet.actuallyadditions.chapter.rf": "RF - Redstone Flux",
  "booklet.actuallyadditions.chapter.rf.text.1": "Since the recent diminishment of what was known as Redstone Flux, a new way of storing power has arisen: <item>Redstone Flux<r>. <n>This stuff is generated by <imp>all<r> Actually Additions <imp>machines<r>, however, it is <imp>compatible<r> with <item>Tesla<r> and <item>Forge Units<r>, meaning machines that use <item>Redstone Flux<r> and machines that use any of the other systems mentioned can be <imp>interconnected without<r> needing any sort of <imp>conversion<r>.",
  "booklet.actuallyadditions.chapter.rf.text.2": "To <imp>transfer<r> <item>Redstone Flux<r>, just place a thing that <imp>generates<r> or transfers it <imp>next to<r> one that <imp>uses<r> or stores it (or any one of the systems mentioned above). You can use an <item>Energizer<r> to <imp>charge up items<r>.",
  
  "booklet.actuallyadditions.chapter.phantomfaces.text.5": "The <item>Phantom Energyface<r> acts exactly like the normal <item>Phantomface<r>, but it <imp>works for RF<r>, meaning you can connect it to things like Generators and Crushers.",
  
  "booklet.actuallyadditions.chapter.drill.text.1": "The <item>Drill<r> works like a Pickaxe and a Shovel. It uses <imp>RF<r> per block. It can be <imp>charged in an Energizer<r> and upgraded by <imp>sneak-right-clicking<r> with it in your hand. There are <imp>a lot of upgrades<r>, but here is an explanation of some of them: <n>The <item>Mining Upgrades<r> enlarge the hole which the Drill digs. <n>The <item>Placement Upgrade<r>, after you right-click it in any slot of your hotbar, will make the Drill able to <imp>place a block from that slot by right-clicking<r>.",
  
  "booklet.actuallyadditions.chapter.staff.text.1": "The <item>Teleport Staff<r>, when charged in an Energizer, can be <imp>right-clicked<r> to <imp>teleport you to where you're looking<r>. When you are looking at a block, it will teleport you there, however, when you aren't looking at a block, you can only be looking upwards up to <imp>5 degrees<r>, otherwise the teleport will fail.",
  
  "booklet.actuallyadditions.chapter.magnetRing.text.1": "The <item>Ring Of Magnetism<r>, when it has been charged in an Energizer and is inside your inventory, uses <imp>RF<r> to suck up items that are farther away than you can pick up by yourself. <n>You can enable and disable it by <imp>sneak-right-clicking<r> with it in hand.",
  
  "booklet.actuallyadditions.chapter.growthRing.text.1": "The <item>Ring Of Growth<r>, when it is charged in an Energizer and in your hand, uses <imp>RF<r> to make plants around you grow much faster.",
  
  "booklet.actuallyadditions.chapter.waterRemovalRing.text.1": "The <item>Ring Of Liquid Banning<r>, when it is charged in an Energizer and in your hand, uses <imp>RF<r> to remove <imp>Lava<r> and <imp>Water<r>.",
  
  "booklet.actuallyadditions.chapter.batteries.text.1": "<item>Batteries<r> are a good way to store RF to move around. They can be <imp>charged in an Energizer<r> and <imp>discharged in an Enervator<r>. <n><n>When holding them in hand, they can be <imp>sneak-right-clicked<r> to put them into <imp>discharge mode<r>. This means that they will <imp>charge<r> any <imp>other items in your inventory<r>.",
  
  "booklet.actuallyadditions.chapter.leafGen.text.1": "The <item>Leaf Generator<r> can generate <imp>RF<r> just by being placed alongside some <item>Leaves<r>. <n>It will destroy the leaves, generating <imp><rf> RF per leaf broken<r> in the process. <n>By right-clicking the generator, you can see how much RF it has stored. <n>It has a <imp>range of <range><r> blocks.",
  
  "booklet.actuallyadditions.chapter.longRangeBreaker.text.1": "The <item>Long-Range Breaker<r> works like a normal <item>Breaker<r>, but it can break <imp>up to <range> blocks in front of it<r>. <n>Per block broken, it uses <imp><rf> RF<r>. <n>When right-clicking it with a <item>Redstone Torch<r> in hand, it will change between a mode where it <imp>gets deactivated by Redstone<r> and a mode where it <imp>responds to pulses<r>. <n><n><i>Breaking the <range>th wall",
  
  "booklet.actuallyadditions.chapter.laserRelays.text.1": "The <item>Energy Laser Relay<r> is a block that can <imp>wirelessly transfer RF<r>. <n>When placing a Power Generator or Receiver next to the relay, it can receive Power <imp>from any other relay<r> in the network and send power <imp>to any other relay<r> as well. <n>During an energy transfer, they have a slight <imp>Energy Loss<r>, but nothing to worry about, especially because it's <imp>per transfer<r>, so it doesn't matter how many Lasers are inbetween two machines, the loss will <imp>always be the same amount<r>.",
  
  "booklet.actuallyadditions.chapter.crystals.text.1": "The <item>Atomic Reconstructor<r> is used to craft <item>Crystals<r>, which are the main crafting ingredient in most items from <imp>Actually Additions<r>. <n>Upon being supplied with power, it shoots out a Laser. <tifisgrin>It will convert all surrounding items and blocks along the beam's path, provided they can be converted, until it hits a block.",
  
  "booklet.actuallyadditions.chapter.crystals.text.2": "When shooting a laser, it uses <imp>1000 RF<r>, but additional rates vary depending on the conversion. <n>There are various <item>Lenses<r> that can be attached to the Reconstructor that don't all follow the default behavior of the Reconstructor and are able to do some neat things. <n>See the <imp>Reconstruction section<r> in the booklet <imp>for more information<r>.",
  
  "booklet.actuallyadditions.chapter.lensDisenchanting.text.1": "The <item>Lens of Disenchanting<r> can be used to <imp>transfer<r> a single <imp>enchantment<r> from an enchanted item to either a <item>Book<r> or an already <item>Enchanted Book<r>. <n>This can be achieved by <imp>throwing the two items in front of the laser<r> (more than one of every type won't work!), but they have to be together <imp>in one blockspace<r>. <n>When they are hit by the laser, the <imp>topmost enchantment<r> from the non-book item is <imp>removed<r> and <imp>added onto the book<r>. <n><n>However, this uses <imp><energy> RF<r>.",
  
  "booklet.actuallyadditions.chapter.lensMining.text.1": "The <item>Lens of the Miner<r> can <imp>create ores<r> out of blocks in its sight. <n>When the laser hits a <item>block of stone<r>, it will convert it into <imp>different overworld ores<r>, whereas a <item>block of netherrack<r> will be converted into <imp>nether ores<r>. <n>Each operation uses <imp><energy> RF<r>, however each operation requires <imp>additional power<r> depending on the rarity of the ore that is generated.",
  
  "booklet.actuallyadditions.chapter.miner.text.1": "The <item>Vertical Digger<r> can be used to automatically <imp>mine blocks<r> from the world. <n>It has two modes: It can either <imp>only mine ores<r> or <imp>mine everything<r>. When mining a block, it uses about <rf> RF. <n>Mined items get stored in an internal buffer that can be accessed through right-clicking. <n><n>Its default radius is <range>, but much like Phantomfaces, the Digger's range can be upgraded by placing 3 or less <item>Phantom Boosters<r> above it.",
  
  "booklet.actuallyadditions.chapter.fireworkBox.text.1": "The <item>Firework Box<r> is a perfect thing for New Year's! When placed down and supplied with some <imp>RF<r>, it will shoot out some <imp>randomly generated<r> <item>Fireworks<r> around it. <n>For each shot, it uses <rf> RF. You can <imp>right-click<r> the block to be able to <imp>precisely configure<r> the types of <item>Fireworks<r> you want to get and <imp>how often<r> you get them, along with a bunch of <imp>other options<r>. Just play around in the GUI to find out what every setting does. <n><n>This is a great way to set up cool looking Firework displays.",
  
  "booklet.actuallyadditions.chapter.shockSuppressor.text.1": "The <item>Shock Absorber<r> is a block that, when supplied with <imp>RF<r>, it will protect an area of <imp>up to <range> blocks around it<r> from any type of <imp>Explosion<r>, be it ghasts, TNT or creepers. <n>Every block that is protected will result in a loss of <imp><rf> RF<r>.",
  
  "booklet.actuallyadditions.chapter.playerInterface.text.1": "The <item>Player Interface<r> works in a similar way to the <item>Phantomface<r>, except it is <imp>connected to a player<r> instead of a block, and the connection is established by <imp>placing it down<r>. <n>When <imp>inputting items<r>, they will <imp>move to the player's inventory<r>. Also, when <imp>inputting RF<r>, it will <imp>charge the items<r> in the player's inventory. <n>It has a default range of <range> blocks, however, it can be expanded by placing up to 3 <item>Phantom Boosters<r> on top of it.",
  
  "booklet.actuallyadditions.chapter.displayStand.text.1": "The <item>Display Stand<r> is a block that can, for one, <imp>display any item or block<r> by right-clicking with it onto the display stand. It will then be floating around on top. <n>To take it out of there again, just right-click with an empty hand. <n><n>The other feature, however, is that some items can be put onto it, <imp>having special effects<r>. This, however, will require the stand to <imp>get RF<r>. Read more on the next page.",
  
  "booklet.actuallyadditions.chapter.displayStand.text.2": "The <item>Leaf Blower<r> and <item>Advanced Leaf Blower<r> can be placed onto the display stand, resulting in the grass and leaves around it to be blown away. <n><n><item>Potion Rings<r> can be placed onto the display stand. The normal version will give the specified potion effect to <imp>only one<r> living entity in a small area, while the advanced version will <imp>give a potion effect to all living entities<r> in a <imp>big area<r> while using up a significant amount of <imp>RF<r>.",
  
  "booklet.actuallyadditions.chapter.empowerer.text.1": "The <item>Empowerer<r> is a mid-tier block that can be used to <imp>empower<r> crystals and other items. <n>To use it, items that should be empowered can be <imp>right-click onto the Empowerer<r>, and empowering items need to be placed on <item>Display Stands<r> that are <imp>two blocks away<r>, like seen in the <imp>picture on the next page<r>. <n>To then activate the process, <imp>every Display Stand needs to be powered with a lot of RF<r> that is then drained to empower the item on the Empowerer.",
  
  "booklet.actuallyadditions.chapter.farmer.text.1": "The <item>Farmer<r> is a block that can, once placed in the world, <imp>plant and harvest<r> different types of <imp>crops<r> and <imp>other plants<r> which can all be seen <imp>on the following pages<r>. <n>The <imp>left side<r> of its GUI is reserved for <item>seeds<r> and other things that should be planted, while the <imp>right side<r> will contain the <imp>harvested goods<r>. <n>It will farm in a <imp>9x9 area<r> in front of it. <n>It uses varying amounts of RF per operation. <n><n><i>my fam",
  
  "booklet.actuallyadditions.chapter.bioReactor.text.1": "The <item>Bio Reactor<r> uses all types of <imp>seeds, foodstuffs and plants<r> to <imp>generate RF<r>! <n>To do this, just <imp>place<r> the items <imp>in its GUI<r>. If you try this out, you will notice that it doesn't generate that much power by default. However, the more <imp>different kinds<r> of plants, seeds and foodstuffs it has, the more power it will generate!",
  
  "booklet.actuallyadditions.chapter.batteryBox.text.1": "The <item>Battery Box<r> is a great way to <imp>store your power<r>. However, for it to be able to <imp>use power<r>, you have to <imp>right-click<r> a <item>Battery<r> onto it. It will then be able to store energy on the battery itself. <n><n>If you set the battery to <imp>discharge mode<r> via <imp>sneak-right-clicking it<r> or by applying a <imp>redstone pulse<r> to the <item>Battery Box<r>, it will try to spread the power it receives equally to <imp>up to 15 adjacent<r> <item>Battery Boxes<r>."
}
